/*
1. Реализовать функцию для вычисления количества строк матрицы, содержащих нули
2. Завершить реализацию функции для удаления первой строки матрицы
3. Реализовать функцию для добавления в матрицу строки (массив значений строки и позиция вставки K передаются как параметры функции вместе с самой матрицей и ее исходными размерами)
4. Реализовать функцию, транспонирующую матрицу

5. Реализовать функцию для вычеркивания из матрицы строки с индексом M и столбца с индексом N (M, N - параметры функции)
6. Реализовать функцию подсчета определителя квадратной матрицы
*/

#include <iostream>
#include "defs.h"

using namespace std;

int main()
{
    const int MAX_ROWS = 50;
    const int MAX_COLS = 50;

    setlocale(LC_ALL, "Rus");
    
    //system("pause");
    return 0;
}
